---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.WinderPathResult.SelfIntersect
enum: Autodesk.Revit.DB.Architecture.WinderPathResult
source: html/4e13811c-ffa6-f862-c7b5-2d75f0797d3f.htm
---
# Autodesk.Revit.DB.Architecture.WinderPathResult.SelfIntersect

The first curve intersect with third curve.